In [1]:
import pandas as pd
import requests
from bs4 import BeautifulSoup
import sqlalchemy
import re

## Creating aisles table and writing it to my AWS machine

In [2]:
aisles = pd.read_csv('data/aisles.csv')
aisles.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [3]:
engine = sqlalchemy.create_engine('postgres://postgres:password@18.223.169.109:5432/postgres')
aisles.to_sql('aisles', engine, if_exists='replace', index=False)

### Inspecting the Aisles table

In [4]:
query = """
SELECT *
FROM aisles
"""

df_in = pd.read_sql_query(query, engine)
df_in.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

## Creating aisles table and writing it to my AWS machine

In [5]:
departments = pd.read_csv('data/departments.csv')
departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [6]:
departments.shape

(21, 2)

In [7]:
engine = sqlalchemy.create_engine('postgres://postgres:password@18.223.169.109:5432/postgres')
departments.to_sql('departments', engine, if_exists='replace', index=False)

### Inspecting the departments table

In [8]:
query = """
SELECT *
FROM departments
"""

df_in = pd.read_sql_query(query, engine)
df_in.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

## Creating order_products_train table and writing it to my AWS machine

In [9]:
order_products_train = pd.read_csv('data/order_products__train.csv')
order_products_train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [10]:
order_products_train.shape

(1384617, 4)

In [ ]:
engine = sqlalchemy.create_engine('postgres://postgres:password@18.223.169.109:5432/postgres')
order_products_train.to_sql('order_products_train', engine, if_exists='replace', index=False)

In [ ]:
query = """
SELECT *
FROM order_products_train
"""

df_in = pd.read_sql_query(query, engine)
df_in.head()

## Creating products table and writing it to my AWS machine

In [4]:
products = pd.read_csv('data/products.csv')
products.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [5]:
engine = sqlalchemy.create_engine('postgres://postgres:password@18.223.169.109:5432/postgres')
products.to_sql('products', engine, if_exists='replace', index=False)

In [6]:
query = """
SELECT *
FROM products
"""

df_in = pd.read_sql_query(query, engine)
df_in.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

## Creating orders table and writing it to my AWS machine

## Creating order products prior table and writing it to my AWS machine

In [12]:
order_products_prior = pd.read_csv('data/order_products__prior.csv')
order_products_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [13]:
order_products_prior.shape

(32434489, 4)

In [ ]:
engine = sqlalchemy.create_engine('postgres://postgres:password@18.221.63.111:5432/postgres')
order_products_prior.to_sql('order_products_prior', engine, if_exists='replace', index=False)

#### Inspecting the Order Products Prior Table in SQL:

In [ ]:
query = """
SELECT *
FROM order_products_prior
"""

df_in = pd.read_sql_query(query, engine)
df_in.head()